; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 895225 2 3 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	image2 - mode
	image0 - mode
	infrared1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image3)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet4)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Planet3 image3)
	(have_image Planet4 image0)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared1)
	(have_image Star7 image2)
	(have_image Planet8 image3)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (turn_to satellite1 star7 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star7)
   goals met: 0 of 7
4. (turn_to satellite0 star6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
5. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 0 of 7
6. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 7
7. (calibrate satellite1 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 7
8. (turn_to satellite0 star2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
9. (turn_to satellite1 star6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
10. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 7
11. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   goals met: 1 of 7
12. (take_image satellite1 star6 instrument5 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 7
13. (take_image satellite0 planet8 instrument2 image3)
   added: (have_image planet8 image3)
   goals met: 3 of 7
14. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 2 of 7
15. (turn_to satellite0 planet3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet3)
   goals met: 2 of 7
16. (take_image satellite1 star7 instrument5 image2)
   added: (have_image star7 image2)
   goals met: 3 of 7
17. (take_image satellite0 planet3 instrument2 image3)
   added: (have_image planet3 image3)
   goals met: 4 of 7
18. (turn_to satellite1 star6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star6)
   goals met: 5 of 7
19. (turn_to satellite0 planet5 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet5)
   goals met: 5 of 7
20. (turn_to satellite1 planet4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet4)
   goals met: 4 of 7
21. (take_image satellite0 planet5 instrument2 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 5 of 7
22. (take_image satellite1 planet4 instrument5 image0)
   added: (have_image planet4 image0)
   goals met: 6 of 7
23. (turn_to satellite1 star6 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star6)
   goals met: 7 of 7
